chore: add diagrams
